Обработки/Reports/_РегистрУчетаПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РегистрУчетаПайщиков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВоВременномХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пайщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РегистрУчетаПайщиков/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Отчет.Период.ДатаНачала 	= НачалоГода(ТекущаяДата());
	Отчет.Период.ДатаОкончания 	= ТекущаяДата();
	Отчет.Выгружать 			= Истина;
	
	Этаформа.ВидРегистра = "Денежные средства";
	
	ОбновитьРасчетныйСчетНаСервере();
	ОбновитьСписокПайщиковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	Для каждого СтрокаПайщик Из Отчет.Пайщики Цикл
		СтрокаПайщик.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	Для каждого СтрокаПайщик Из Отчет.Пайщики Цикл
		СтрокаПайщик.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Отчет.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Отчет.КаталогДанных = Диалог.Каталог + "\" + "ДС_" + СократитьНазваниеПИФ(СокрЛП(Отчет.СчетДоверительногоУправления)) + "_"+ Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yy") + "_"+ Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yy") + ".xlsx";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.КаталогДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Отчет.Период.ДатаНачала < '20170101' Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Регистр до 01.01.2017 г. нужно формировать из 1С 7.7");
		Отчет.Период.ДатаНачала = '20170101';
	КонецЕсли;
	
	ОбновитьИмяФайлаВыгрузки();
	ОбновитьСписокПайщиковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьИмяФайлаВыгрузки();
	ОбновитьРасчетныйСчетНаСервере();
	ОбновитьСписокПайщиковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИмяФайлаВыгрузки()
	
	Если Не (ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) И ЗначениеЗаполнено(Отчет.Период)) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Отчет.КаталогДанных) Тогда
		Возврат;
	КонецЕсли;
	
	ТекКаталог = "";
	ПоследнийРазделитель = СтрНайти(Отчет.КаталогДанных, "\", НаправлениеПоиска.СКонца);
	Если ПоследнийРазделитель > 1 Тогда
		ТекКаталог = Лев(Отчет.КаталогДанных, ПоследнийРазделитель - 1);
	КонецЕсли;    	
	
	Отчет.КаталогДанных = ТекКаталог + "\" + "ДС_" +  СократитьНазваниеПИФ(СокрЛП(Отчет.СчетДоверительногоУправления)) + "_"+ Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yy") + "_"+ Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yy") + ".xlsx";

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	Отчет.АдресВоВременномХранилище = "";		
	СкомпоноватьРезультат();
	
	Если ПустаяСтрока(Отчет.АдресВоВременномХранилище) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не сформирован");
		Возврат;
	КонецЕсли;
	
	Если Отчет.Выгружать Тогда           		
				
		МассивФайлов = ПолучитьИзВременногоХранилища(Отчет.АдресВоВременномХранилище);
		
		Если МассивФайлов.Количество() > 0 Тогда
			ПодготовитьФайлРегистра(МассивФайлов, СокрЛП(Отчет.СчетДоверительногоУправления));		
		КонецЕсли;
			
	Иначе
		
		ТабДокумент = ПолучитьИзВременногоХранилища(Отчет.АдресВоВременномХранилище);
		
		Табдокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
		ТабДокумент.ОтображатьСетку 	= Ложь;
		ТабДокумент.ТолькоПросмотр 		= Истина;
		ТабДокумент.Показать("Регистр учета пайщиков");
		
	КонецЕсли;
		
	УдалитьИзВременногоХранилища(Отчет.АдресВоВременномХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьПриИзменении(Элемент)
	
	НастроитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ОбновитьРасчетныйСчетНаСервере()
	
	Если Не ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет
	|ИЗ
	|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
	|ГДЕ
	|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
	|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.ТранзитныйПИФ";
	
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Отчет.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Элементы.РасчетныйСчет.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("РасчетныйСчет"));
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Отчет.РасчетныйСчет = Выборка.РасчетныйСчет;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден транзитный счет ПИФ");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПайщиковНаСервере()
	
	Если Не (ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) И ЗначениеЗаполнено(Отчет.РасчетныйСчет)) Тогда
		Возврат;
	КонецЕсли;
	
	Отчет.Пайщики.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДенежныеСредстваПереданныеВОплатуПаевОбороты.Пайщик КАК Пайщик
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И РасчетныйСчет = &РасчетныйСчет) КАК ДенежныеСредстваПереданныеВОплатуПаевОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
	|				ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор КАК Документ.ВводДенежныхСредств).Основание <> ЗНАЧЕНИЕ(Документ.ЗаявкаПайщика.)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДенежныеСредстваПереданныеВОплатуПаевОбороты.Пайщик.Наименование";
	
	Запрос.УстановитьПараметр("НачалоПериода", 					Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 					КонецДня(Отчет.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", 					Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Отчет.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("РасчетныйСчет", 					Отчет.РасчетныйСчет);

	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Отчет.Пайщики.Добавить();
		НоваяСтрока.Пайщик	= Выборка.Пайщик;
		НоваяСтрока.Пометка	= Истина;
		
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФайлРегистра(МассивФайлов, НаименованиеПИФ)

	НаименованиеПИФ = СократитьНазваниеПИФ(НаименованиеПИФ);
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
				
		ОбщийФайл = Excel.Workbooks.Add();
		Если ОбщийФайл.Sheets.Count > 2 Тогда
			ОбщийФайл.Sheets(1).Delete();
			ОбщийФайл.Sheets(1).Delete();
		КонецЕсли;
		
		Если ОбщийФайл.Sheets.Count > 1 Тогда
			ОбщийФайл.Sheets(1).Delete();
		КонецЕсли;
	        	
		КоличествоФайлов = МассивФайлов.Количество();
		Сч = КоличествоФайлов - 1;
		Пока  Сч >= 0 Цикл
			
			СтруктураФайла = МассивФайлов[Сч];
			ИмяФайлаПоОдномуПайщику = КаталогВременныхФайлов() + "\" + СтруктураФайла.ИмяЛиста + ".xlsx";
			СтруктураФайла.Файл.Записать(ИмяФайлаПоОдномуПайщику);
			ФайлПоОдномуПайщику = Excel.Workbooks.Open(ИмяФайлаПоОдномуПайщику);
			ФайлПоОдномуПайщику.Sheets(1).Move(ОбщийФайл.Sheets(1));
			ОбщийФайл.Sheets(1).Name = СтруктураФайла.ИмяЛиста;
			
			УдалитьФайлы(ИмяФайлаПоОдномуПайщику);
			
			Сч = Сч - 1;
			
		КонецЦикла;
		
		// Удаляем последний "типовой" лист
		Если КоличествоФайлов < ОбщийФайл.Sheets.Count Тогда
			ОбщийФайл.Sheets(КоличествоФайлов + 1).Delete();
		КонецЕсли;
		
		Excel.Visible = 1;

		ОбщийФайл.SaveAs(Отчет.КаталогДанных);
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Функция СократитьНазваниеПИФ(СтрПИФ)
	
	Если СтрПИФ = "" Тогда
		Возврат СтрПИФ;
	КонецЕсли;
	
	Кавычки = Прав(СтрПИФ, 1);
	
	СтрПИФ = СтрЗаменить(СтрПИФ, Кавычки, "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " комбинированный", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " смешанных инвестиций", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " рыночных финансовых инструментов", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " долгосрочных прямых инвестиций", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " прямых инвестиций", "");
	
	Возврат СтрПИФ;
	
КонецФункции

&НаКлиенте
Процедура НастроитьДоступность()
	
	Элементы.КаталогДанных.ТолькоПросмотр = Не Отчет.Выгружать;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура РасчетныйСчетПриИзмененииНаСервере()
	
	ОбновитьСписокПайщиковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	РасчетныйСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
